cf/Catalogs/Матрицы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Матрицы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипМатрицы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМатриц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Это1К1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка_32</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка_32_откл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбязательныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопМатрица</Name>
							<Comment>Обязательные поля действуют вместе с этой доп матрицей, если не указано тогда неважно</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Матрицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Матрицы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// СТАНДАРТНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаВкл 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка_32");
	КартинкаОткл 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка_32_откл");
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьКартинку(КартинкаВкл, 	ТекущийОбъект.Картинка_32);
	ЗаписатьКартинку(КартинкаОткл, 	ТекущийОбъект.Картинка_32_откл);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Адрес, ХранениеВОбъекте);
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ХранениеВОбъекте = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес)); КонецЕсли;
	
КонецПроцедуры


// ДИАЛОГ

&НаКлиенте
Функция ПолучитьДВКартинки()
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр = "прозрачная картинка png|*.png";
	
	Возврат ДВ;
	
КонецФункции
&НаКлиенте
Процедура ВыбранаКартинка(ПомещенныеФайлы, ИмяРеквизита) Экспорт
	
	Если ПомещенныеФайлы <> Неопределено Тогда 
		ЭтаФорма[ИмяРеквизита] = ПомещенныеФайлы[0].Хранение;
		Модифицированность = Истина; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ВыбранаКартинка", ЭтаФорма, Элемент.Имя),,ПолучитьДВКартинки(), Истина, УникальныйИдентификатор);
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьИзДругойМатрицыНаСервере(Матрица)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ИмяПоля ИЗ Справочник.Матрицы.ОбязательныеРеквизиты ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Матрица);
	КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(Объект.ОбязательныеРеквизиты, Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбранаМатрицаДляКопирования(ВыбМатрица, ДопПараметры) Экспорт
	
	Если ВыбМатрица <> Неопределено Тогда
		ДобавитьИзДругойМатрицыНаСервере(ВыбМатрица) КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьИзДругойМатрицы(Команда)
	
	ОткрытьФорму("Справочник.Матрицы.ФормаВыбора",, ЭтаФорма,,,,Новый ОписаниеОповещения("ВыбранаМатрицаДляКопирования", ЭтаФорма));
	
КонецПроцедуры
